{
    "count": 30,
    "next": "https://encurate.app/meta/blogsapi/?ordering=-date_published&page=2",
    "previous": null,
    "results": [
      {
        "id": 31,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "What To Do When You’re Eating Healthy, Exercising, and Not Seeing Results",
        "body": "It’s a common issue, and about as frustrating as it gets. You’re being mindful of your food choices, avoiding junk, exercising regularly, and still you aren’t seeing the results you expect. Maybe you aren’t seeing any results at all! There’s nothing more discouraging than feeling like you’re doing everything right, only to be met with nothing to show for your effort. Fortunately, because I’ve seen this problem so often in my clients over the years, I’ve got two easy solutions to share with you. \r\n\r\nMake no mistake, if you are making healthy food choices and exercising, but still not seeing results, it means somewhere along the way you are eating more than you realize. It’s an easy mistake to make. I call them “invisible calories.” A handful of something here or a taste of something there. Maybe just a bite, a spoonful, or a taste. We eat these foods but don’t think they’re worth logging because, “it can’t be that much\r\nanyway.” The problem is that we’re often wrong. In one singular event this might be true, but often we allow ourselves to do this multiple times a day. It can add up fast.\r\n\r\nHere you’ll get the strategies I use with my clients to eliminate these invisible calories and start seeing results again.\r\n\r\nTrack Everything\r\n\r\nI want to share a story about peanut butter. It’s delicious, but that’s not the whole story. I used to buy the large, 48oz family-size, jars of peanut butter. It’d take me about a week and a half to finish. (By myself, of course.)After a few weeks I was getting suspicious. I had been tracking my food as usual but not seeing the steady weight loss I would normally expect for the nutrition plan I was following. It seemed my weight wouldn’t budge. What gives?\r\n\r\nI decided to look back to figure out what was going on. (One of the benefits of food logging is having a record to look at later.) During this time I had developed a habit of using just the tip of a spoon to scoop some peanut butter for a little taste, every time I was passing through the kitchen. It seems harmless, right? I mean, how many calories can such a small amount of peanut butter really add to the grand scheme of my day or the week at large? \r\n\r\nThe problem wasn’t the quantity in any particular spoon tasting, it was the frequency with which I participated in this new habit. It was happening throughout the day, multiple times, every day of the week. In a 48oz jar of peanut butter there are 32 servings (2 tbsp), with each serving containing 190 calories. After reviewing my food logs over the lifespan of one of these jars, I found that I had only logged twelve of these servings. “Officially,” I had only consumed twelve servings, but the jar was clearly gone.\r\n\r\nThat means I consumed an extra twenty servings of peanut butter that had become “invisible calories,” calories I was eating that failed to be accounted for. Over the course of a week that’s an extra 3,800 calories, almost two full days worth, without even realizing it. This is why tracking everything, no matter how small, is important for ensuring you aren’t actually eating more than you realize. (It’s an easy thing to do.) Foods will often surprise you with how many calories they contain, and keeping a log will help you identify whether your “harmless handfuls” are actually holding you back.\r\n\r\nHere’s another example: I have a client who had gotten relaxed about her logging. Admittedly, she’d been tracking for awhile and has a pretty goodgrasp on the calorie content of most things she eats. Yet, she wasn’t seeing any progress and didn’t know why. \r\n\r\nI encouraged her to sit down and track everything she ate at a recent dinner party she had attended. She ate well: a small piece of steak, minimal potatoes, lots of veggies, and limited herself to not more than two beers. She even fasted that day so she had extra calories to spend. She was convinced everything was going to be under her goal for the day. \r\n\r\nAfter sitting down and tracking everything, she realized each beer had 250 calories and drinking two meant a third of her calories were already gone. \r\n\r\nThe steak wasn’t the leanest cut, that took up another third. She had a few “cheesy bites” before dinner, and three of those had a whopping 140 calories. In the end, her one meal of the day put her over her daily goal. Imagine how far over she’d have been if she had eaten regular meals before this? It is incredibly easy to over-consume food, even healthy food. Tracking everything you eat diligently is a key habit in order to avoid invisible calories halting your progress. Here a two quick tips for logging:\r\n\r\n1) Log before you take your first bite. This way it’s done and you can accurately track the portions while you’re looking at them.\r\n\r\n2) Err on the side of over-logging calories. If you estimate more than you actually eat, you’ll definitely fall within your calorie goal. Underestimating will send you over, quick. Buy A Food Scale\r\n\r\nTo illustrate the power of weighing your food, let me tell you a story about oatmeal. (A healthy food, right?) I love oatmeal, especially overnight oats, and I eat it almost daily. For those who are unfamiliar, a serving of oatmeal is 150 calories for a 1/2 cup serving—forty grams worth of oats. I would usually eat two servings at atime (sometimes twice a day), and would use a measuring cup to make sure I was accurate. Hey, I was tracking it, right?\r\n\r\nI ran into the same problem as before, hard work and diligent tracking but little or no results. I was even being sure I was good about tracking everything. Still no results! I decided to buy a food scale one day to help increase the accuracy of my tracking. While I bought it primarily for meat (it’s hard to fit in a measuring cup), I was curious how accurate my “1/2 cup” servings of oats actually were. So I compared. I placed an empty bowl on the food scale and poured in my 1/2 cup serving of oats. (Remember, this should have come out to forty grams.)\r\n\r\nThe scale said sixty grams! That is 50% more oats than I intended, masked as a single serving. This happened because, like many people, when I use a measuring cup I turn it into a “bag sale”—everything you can fit in the bag at one low price. I assumed if it was a 1/2 cup per serving, that meant whatever I could possibly fit in the measuring cup counted as one serving. (Let’s just say it was a very rounded scoop, not a level scoop.)\r\nMaking this mistake twice per day meant that I was consuming an extra serving of oats without realizing it; another 150 of these invisible calories. \r\n\r\nThat adds up to an extra 1,050 calories across one week! I’ll tell you another story about one of my clients, whom we recently ran into this problem with. He was making good food choices, great food choices actually, but still seeing minimal progress. I encouraged him to invest in a food scale. (I say invest, but they’re super cheap.) He was regularly eating salmon for dinner, and was logging one filet of salmon at around 300  calories. Nothing out of the ordinary here, that’s within the ballpark for something like this. He might have two of those for dinner.Then we had him weigh the salmon. Sure, he was eating one filet, that filet\r\njust happen to weigh close to one pound! You bet he was satisfied after that meal, but he was also eating over 1,000 calories per filet, and sometimes he’d have two! That is almost an entire day’s worth of calories that is being overlooked. It’s a miracle he wasn’t gaining any weight, let alone losing any.\r\n\r\nIf you’re tracking diligently, but still not seeing the results you want, I would definitely get a food scale and start weighing everything you eat. This will increase the accuracy of your logs and help prevent any incidents of these invisible calories. Here are two food scale tips: \r\n\r\n1) Weigh in grams as much as possible. It’ll be more accurate, and just about everything has a gram measurement for servings. \r\n\r\n2) All nutrition labels show a serving size in both volume (cups, oz, etc.) and weight (grams) measurements. The weight will always be in parentheses.\r\n\r\n3) You don’t need to spend more than $20 on a food scale. \r\n\r\nIf you feel discouraged because you’ve been doing everything right, are doing it consistently, and still aren’t seeing results, then I urge you to follow my advice using the above strategies. Remember, if you aren’t losing weight you are eating too much. These strategies can help you figure out where that’s happening.",
        "excerpt": "It’s a common issue, and about as frustrating as it gets. You’re being mindful of your food choices, avoiding junk, exercising regularly, and still you aren’t seeing the results you expect. Maybe you aren’t seeing any results at all!",
        "tags": "healthy, eating, exercise",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Photo by Pixabay",
        "imageOwnerBacklink": "https://www.pexels.com/photo/woman-with-white-sunvisor-running-40751/",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/What_To_Do_When_Youre_Eating_Healthy_Exercising_and_Not_Seeing_Results-pexels_uGPvljE.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:22:51.034849Z",
        "website": null
      },
      {
        "id": 30,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "Weight loss, self-esteem and emotional hunger",
        "body": "The ideal body prototype, the self-imposed canons of beauty in society and/or the fear of gaining weight is a widespread contemporary feeling. All of these affect the emotional relationship with food.\r\n\r\nIn fact, the caloric or nutrient content of food, even if false, can alter emotions toward food. Macht et al 2003 conducted a study where they observed that negative emotions occurred more frequently when the energy content of food increased. In other words, when the subjects were told that the food they had eaten was higher in calories, the subjects' happiness decreased, especially in women who were obese. Therefore, we confuse the energy value of food with its healthiness, thinking that the higher the energy content of food, the more \"unhealthy\" and \"dangerous\" that food is considered to be.\r\n\r\nThis undoubtedly contributes to the emotion/food relationship, and when we eat certain foods that are initially attractive and pleasurable, when consumed they generate a feeling of guilt for being too high in calories. This tends to be common, especially after excessive restriction of food for aesthetic purposes. In fact, very rigid dietary approaches have been shown to be associated with binge eating, especially in the presence of disinhibitors such as alcohol or stress (Sainsbury K 2017; Evans EH 2018).\r\n\r\nThis emotion/food relationship undoubtedly is one of the problems to be addressed in the treatment of obesity and/or eating disorders. Difficulties in emotion regulation are associated with binge eating and may represent a barrier to the effectiveness of long-term intervention in obesity.\r\n\r\nInadequate emotion regulation can result in overeating in response to negative emotions and using food to suppress unpleasant emotional experiences. This is known as \"emotional hunger\" (Evers et al, 2010). Emotional hunger is associated with worse prognoses in dealing with obesity, with worse weight loss outcomes (Canetti et al 2009).\r\n\r\nTherefore, in some individuals, a vicious circle is generated that maintains or worsens the state of obesity, being that their negative emotional state increases food intake and as a consequence, an increase in body weight, causing greater dissatisfaction with their physique, lower self-esteem and enhancing this negative emotional state.\r\n\r\nOn the other hand, a healthy and balanced diet translates into greater satisfaction on a psychological level, greater energy and, in turn, can be linked to a healthy lifestyle, which can be translated into the practice of physical exercise and, in this way, intervene in an increase in satisfaction and self-esteem.\r\n\r\nIn terms of gender, women tend to present greater rejection and negative emotions towards food, which is related to weight gain (Narchi et al 2008), but this circumstance is increasingly seen among men.\r\n\r\nWhat can dietitians and/or dietitian-nutritionists do?\r\nObviously, referral to professional psychologists is a must in most cases, at least the most profound ones. In our duty, we must take into account some premises that can help. For a correct compliance with the diet, in all patients, but fundamentally in the \"emotionally fragile\" patient, or who eats as a response to emotions, we must:\r\n\r\n• Resort to techniques of motivation and reinforcement of self-esteem and self-confidence.\r\n• Identify those emotions related to eating.\r\n• Restructure erroneous thoughts and demystify concepts.\r\n• Establish the maintenance of healthy nutritional habits.\r\n• Establish achievable goals to avoid early frustrations.\r\n• To be part of a multidisciplinary team that includes medical, nutritional and psychological aspects.",
        "excerpt": "The ideal body prototype, the self-imposed canons of beauty in society and/or the fear of gaining weight is a widespread contemporary feeling. All of these affect the emotional relationship with food.",
        "tags": "weight loss,emotional hunger,self esteem",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Photo by JÉSHOOTS",
        "imageOwnerBacklink": "https://www.pexels.com/photo/barbecue-bbq-delicious-dinner-3690/",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Weight_loss_self-esteem_and_emotional_hunger-pexels-j%C3%A9shoots-3690.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:16:51.831497Z",
        "website": null
      },
      {
        "id": 29,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "8 things you should know about rebel fat.",
        "body": "Rebel fat is one of the main problems you'll encounter if you lower the % fat enough. What is rebellious fat? Why does it cost so much to reduce? Let's go see him.\r\n\r\nWHERE'S THE REBEL FAT?\r\n\r\nInitially when you go on a diet the weight flies away, but the more defined you are, the harder it is to lose excess fat and lose the fat percentage. This, in addition to being caused by many metabolic adaptations that your body performs as a defense mechanism (which I will talk about in a future article) is also caused by the well-known rebellious fat and its special characteristics that we will see below.\r\n \r\nFAT LOSS\r\n\r\nFirst of all let's go in parts. Let's understand how body fat burns because it's not a single process.\r\n\r\nIt is based on 3 parts mainly:\r\n\r\nMOBILIZATION: This is basically that fat comes out of adipocytes, which are fat cells. It is stored in the form of triglycerides, so it must be broken into 3 fatty acids and a glycerol molecule. This process is regulated by an enzyme called HSL (Hormone-Sensitive Lipase) and on this enzyme they basically act insulin and catecholamines (adrenaline and norepinephrine). Short: Insulin inhibits mobilization while catecholamines promote it.\r\n\r\nTRANSPORT: Once the triglycerides have been hydrolyzed they pass into circulation linked to a protein called albumin. For the transport of fatty acids to be effective there must be a good blood supply in the area. Here we have clear differences between \"normal\" fat and unruly fat (we'll talk about this later).\r\n\r\nUTILIZATION: AG bound to albumin will eventually reach a tissue, where they can be used as fuel or re-absorbed as triglycerides. For the first thing, which is what we are interested in, they will enter the mitochondria using an enzyme called CPT and will be used for that purpose.\r\n\r\nFirst of all I would like to make an important note:\r\n\r\nMany people believe that insulin, by preventing the action of HSL, is a hormone that makes fat loss impossible. In addition, insulin is one of the main regulators of LPL (Lipoprotein Lipase), an enzyme that stimulates lipogenesis (creation of adipose tissue) so evil is twofold. Carbohydrates, by promoting insulin secretion, are demonized because they seem to make you fat.\r\n\r\nWhat everyone who follows this line of reasoning obviates are two very important factors:\r\n\r\nThe presence of fat also inhibits the action of HSL. Even though insulin levels are low.\r\nAdipocytes are able to create a hormone called ASP (Acillation Stimulating Protein) when fatty acid levels in the blood are high enough, and that is more effective than LPL when accumulating fat. ASP is also insulin-independent.\r\n\r\nI'll never get tired of trying to take away the fear of carbohydrates.\r\nTo give you an idea of the importance of this hormone: Rats that have ASP but do not have LPL can store fat. Rats that have LPL but don't have ASP, no.\r\n\r\nREBEL FAT\r\nWe've already seen what steps are needed for fat burning, but that doesn't explain why rebellious fat is unruly. To do this, we need to look at the characteristics of this type of fat and compare it with the standard adipose tissue. That's where we'll find the answer.\r\n\r\nAnd the answer seems to be that it is in 2 of the steps of fat burning, since unruly fat gives problems in both mobilization and transport.\r\n\r\nFat cells on your surface have several receptors, called adrenoreceptors or adrenergic receptors, Alpha and Beta, to which catecholamines (adrenaline and norepinephrine) attach. Although there are many subtypes we will focus on Alpha-2 and Beta-2, which for this case are the most important.\r\n\r\nRemember that at first I told you that catecholamines promote the mobilization of fats because they act on the Sensitive Hormone Lipasa? Well, it's true, but halfway. Depending on the receptors in which catecholamines are joined, mobilization is promoted or inhibited.\r\n\r\nWhen catecholamines are joined to Beta-2 receptors, fatty acid mobilization is promoted, as can be seen in the following image:\r\n\r\n \r\nThe problem is when catecholamines are joined to Alpha-2 receptors, which inhibits fat mobilization. Therefore, depending on the type of receptor they join, catecholamines are an aid or are an impediment.\r\n\r\nFor that is one of the reasons why rebellious fat is rebellious: Its amount of Alpha-2 receptors is very high, while the amount of Beta-2 is very low. That's why fat initially goes very fast, as adipose tissue that has a high beta-2 and very low Alpha-2 tissue is usually mobilized first. As the % fat drops, there is less and less normal fat and more unruly fat.\r\n\r\nTHE BAD NEWS FOLLOWS\r\n\r\nAs if that wasn't enough, the rebellious fat has two more surprises.\r\n\r\nFirst of all, the blood supply reaching the rebel areas is much lower. If you remember the second step for fat burning, once we have mobilized the fatty acids we have to get them out of there and transport them to the tissues in order to use them. It makes sense that more blood supply will help transport, but unruly fat has very little. Therefore, it costs a lot to mobilize fatty acids and it costs a lot to transport them.\r\n\r\nSecondly, depending on the type of fatty acids that are stored, it will be more or less easy to mobilize them. Polyunsaturated are the easiest, followed by monounsaturated ones. The saturated ones are the last. Well, guess what kind of fatty acids usually accumulate in unruly areas... Evidently, the saturated ones.\r\n\r\nAnd to finish, unruly fat has a lot of insulin sensitivity. That means it costs very little to introduce triglycerides inside, but it's hard to get them out.\r\n\r\nCome on, a gem. Evolutionarily, rebellious fat is a work of art. For aesthetics, a real nightmare.\r\n\r\nOKAY, SO WHAT DO WE DO?\r\n\r\nOnce we've identified our enemy, we know how to take him down. And to wipe out the rebellious fat, we can do several things.\r\n\r\nWe know that insulin blocks the action of HSL, so we want low insulin levels, so we will reduce CH in quantity and also choose the least insulinogenic sources.\r\n\r\nWe want high catecholamines as these are necessary for the mobilization of fatty acids. To achieve this we have several options: caloric deficit (this we will do imperatively), intermittent fasting, intense weight exercise, HIIT type cardiovascular exercise. Reducing CH will also raise catecholamines.\r\n\r\nUse supplementation to help us with adrenoreceptors. We'll see about this below.\r\n\r\nADRENORECEPTORS - AGONISTS AND ANTAGONISTS\r\nAs we have already said, adrenoreceptors can be Alpha or Beta. To get a mental idea, let's think of the Betas as a car accelerator and the Alphas as the brake.\r\n\r\nAgonist or antagonistic compounds may act in them. An agonist is a compound that activates the receiver in question. Instead, an antagonist blocks it. Seeing this and knowing the composition of rebellious fat adrenoreceptors we have two options.\r\n\r\nUse Alpha receptor antagonists. It would be the equivalent of s still stepping on the brakes, blocking its action.\r\n\r\nUse Beta receptor agonists. Here we would be tightening the accelerator even more, promoting its action.\r\n\r\nAn example of Alpha receptor antagonist is Yohimbine.\r\n\r\nAn example of Beta receptor agonist is Ephedrine or Synephrine.\r\n\r\nVERY CAREFUL\r\n\r\nNever use an Alpha receptor antagonist as well as a Beta receptor agonist. It can dramatically increase blood pressure and heart rate. I repeat: NEVER USE THEM AT ONCE.\r\n\r\nCARDIOVASCULAR EXERCISE\r\n\r\nThere are a number of protocols that allow to act quite effectively in rebellious fat, but they are four protocols, quite extensive and I think the article is getting a little long. So I reserve them for the next one, where I'll explain them in detail.",
        "excerpt": "Rebel fat is one of the main problems you'll encounter if you lower the % fat enough. What is rebellious fat? Why does it cost so much to reduce? Let's go see him.",
        "tags": "rebel fat",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Photo by Karolina Grabowska",
        "imageOwnerBacklink": "https://www.pexels.com/photo/crop-sportswoman-exercising-with-gymnastic-hula-hoop-4498154/",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/8_things_you_should_know_about_rebel_fat.-pexels-karolina-grabowska-4498154.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:15:14.914038Z",
        "website": null
      },
      {
        "id": 28,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "It's not losing weight, it's losing fat",
        "body": "The upper part of the figure shows the before and after cross-sectional image of a subject with obesity who has followed a diet-only intervention to lose body fat.\r\n\r\nIn the lower part of the figure, the before and after image of another person with obesity who has followed an intervention to lose fat, but this time combining diet and training.\r\n\r\nIn the case above (example 1), we see the effects on body weight, fat mass and muscle mass after the diet-only intervention. Although there was a large loss of body fat, there was also too high a loss of muscle mass. This loss of lean tissue will imply not only a possible worsening of health, but also a possible regain of lost body fat in the medium to long term.\r\n\r\nHowever, in the case below (example 2), where diet and exercise (strength + cardio) were combined, although less total weight and body fat percentage was lost, muscle mass not only did not decrease, but also increased.\r\n\r\nMuscle strength also increased, implying an improvement in muscle quality. Undoubtedly, this second intervention is a better option than the first one of diet alone.\r\n\r\nTherefore, we see how in the case above, although the subject lost more total weight, the result was worse than in the case below. And the fact is that simply relying on body weight is a mistake.\r\n\r\nToo many people worry too much about the data reported by the scale, i.e. the weight, when in fact this data alone is of little use, except in extreme cases of underweight or overweight. If the scales show a drop in weight, but this loss implies a severe reduction in muscle mass, the result will be disastrous.\r\n\r\nStop worrying so much about whether the scale goes up or down, because this data alone does not indicate that you are getting better or worse, it may even be the opposite of what you think. Basing yourself on this will only generate frustration and an unrealistic perception of the process.",
        "excerpt": "The upper part of the figure shows the before and after cross-sectional image of a subject with obesity who has followed a diet-only intervention to lose body fat.",
        "tags": "weight loss",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Photo by The Lazy Artist Gallery",
        "imageOwnerBacklink": "https://www.pexels.com/photo/woman-doing-exercise-inside-gym-2247179/",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Its_not_losing_weight_its_losing_fat-pexels-the-lazy-artist-gallery-2247179.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:10:29.270358Z",
        "website": null
      },
      {
        "id": 27,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "How to lose visceral fat: diet or exercise?",
        "body": "Exercise improves the metabolic alterations associated with obesity (such as insulin resistance and/or inflammation) independently of weight loss. That is to say, exercise by itself can improve these pathologies even without caloric deficit or weight loss in the subject. However, the loss of visceral fat (fat located internally in the abdomen, surrounding the organs and tissues found there) seems to be a mediator without which substantial improvements in these alterations would not occur, i.e., losing visceral fat is key to the improvement of these metabolic and inflammatory alterations associated with excess fat, regardless of whether or not there are changes in total adiposity.\r\n\r\nExercise decreases visceral fat even without producing relevant weight loss, since the adipocytes (adipose tissue cells) predominant in visceral adipose tissue appear to have a greater number of β3 receptors (exerts lipolytic effects by favoring lipolysis of triglycerides through the action of SLH) releasing stored fatty acids. In addition, the adipocytes of visceral adipose tissue show a decrease in α2 receptors, which has the opposite effect (inhibiting lipolysis).\r\n\r\nThus, the decrease in visceral fat exerted by exercise is greater than that produced by diet (although both are inseparably necessary) as the greater number of β3 receptors facilitates catecholamine-mediated lipolysis (mediated by exercise), which translates into a lower probability of alterations such as an inflammatory state, insulin resistance, etc.\r\n\r\nAnd specifying a little more, strength training seems to be one of the best tools to effectively reduce visceral fat deposits, although so does resistance exercise (especially high intensity), being the concurrence between the two surely the best option. Yes, when we talk about health and fitness improvement, without a doubt strength + cardio always wins.",
        "excerpt": "Exercise improves the metabolic alterations associated with obesity (such as insulin resistance and/or inflammation) independently of weight loss. That is to say, exercise by itself can improve these pathologies even without caloric deficit or weight loss in the subject.",
        "tags": "weight loss, visceral fat",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Photo by Towfiqu barbhuiya",
        "imageOwnerBacklink": "https://www.pexels.com/photo/a-man-holding-his-tummy-11911053/",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_to_lose_visceral_fat_diet_or_exercise-pexels-towfiqu-barbhuiya-11911053.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:08:42.604835Z",
        "website": null
      },
      {
        "id": 26,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "How does fat loss cycles affect muscle tissue?",
        "body": "It is very common among the population, that arises the spontaneous and urgent need to \"go on a diet\" sporadically to achieve a desperate fat loss for an important event or for the summer, which are nothing more than a desperate and misguided attempt to achieve a timely aesthetic improvement. Not only will it be an attempt against health, but also the improvements in body composition will be a temporary mirage, since in these situations sometimes absurd and risky protocols are usually carried out that not only endanger your muscle mass, but also encourage the regain of body fat after the stipulated date.\r\n\r\nWeight gain and loss is often observed in obesity and there is a regaining of lost weight after \"dieting\". Recovery of lost weight is stipulated at a rate of over 30% of subjects in 1 year and 95% at 5 years, i.e., a total failure.\r\n\r\nDuring weight gain, the increase in fat mass is high compared to changes in muscle mass, so during these weight fluctuations, we can assume that participants lose and regain fat, but at the same time experience a loss of muscle mass, leading to the onset of what we know as sarcopenic obesity which I will discuss later. This could be explained in part by the accumulation of lipids (lipotoxicity), which prevents the incorporation of amino acids and reduces protein synthesis in skeletal muscle.\r\n\r\nIn fact, the very loss of muscle mass of these \"protocols\" induces that subsequent fat regain, due to what we know as proteinostat. I explain:\r\n\r\nWhen we lose body fat by being subjected to a caloric deficit, hormonal and metabolic alterations occur that make us increase our appetite. For a long time, this hunger-satiety mechanism has been said to be controlled by certain hormones emitted by adipose tissue, the best known being leptin, which is a hormone emitted mostly by adipose tissue and which exerts an appetite-suppressing effect. Logically, when fat is lost, together with a reduction in calories and carbohydrates, less leptin is emitted and the sensation of hunger is not emitted, so it increases (which is why many bodybuilders cannot stop eating after a competition). This widespread theory is known as the \"leptinocentric\" or \"Adipostat\" theory.\r\n\r\nHowever, we know that muscle tissue has a lot to do with this, because as we see in the graph, in a study known as the Minnesota experiment, subjects were put in extreme caloric deficit. The people went down they lost fat (blue line) but also a lot of muscle mass (red line), and when they went back to eating normal calories, the hyperphagia (increased appetite) did not stop until they regained their previous fat levels but continued until they regained their muscle mass levels, but at the same time there was what is known as collateral fattening, since their fat levels (blue line) increased even more above their basal levels because they could not stop eating.\r\n\r\nThis tells us two things: first that the adipostat theory is not the only one that influences hunger-satiety control and that muscle tissue plays an important role in it and second that any weight loss strategy in which muscle mass is lost (especially by extreme restrictions or by not performing strength training) are doomed to failure and that a yo-yo effect occurs.\r\n\r\nOkay, but let's continue....\r\n\r\nOnce we have regained that lost adipose tissue (with some extra kilograms added) after that desperate attempt to improve the physique in a short time, surely, after a while, there is again a negative feeling of wanting to lose fat again, as there is usually a feeling of guilt for having regained those kilos of fat lost.\r\n\r\nSo we return to undergo periods of caloric restriction, which hopefully this time, is not for a one-time event and there is awareness of the process and the importance of putting yourself in the hands of a qualified professional. But even so, the rate of abandonment before a nutritional intervention is very high. This can be due to multiple reasons, involving both the person concerned, the professional, and the social, economic and work environment of the subject in question. Therefore, creating adherence is key in any fat loss intervention.\r\n\r\nSo what's going on here? Let's see...\r\n\r\nDue to a lifestyle, a sedentary context and bad protocols and diets established for rapid fat loss, we now surely find ourselves with a double problem, not only does the subject in question have excess body fat, but also has low muscle quantity/quality, and may be what we call sarcopenic obesity or sarco-obesity.\r\n\r\nObesity creates a chronic low-level inflammatory environment that can influence muscle remodeling, leading to impaired myocyte formation and, in addition, deposition of fibrotic and adipose tissue, with a consequent reduction in muscle structural integrity and functional capacity.\r\n\r\nIn a recent study, Rossi et al 2019 show how subjects (60 men and 147 women with obesity) who experience a greater number of weight gain and weight loss cycles over their lifetime have lower muscle mass and strength\r\n\r\nThe risk of developing sarcopenia was almost six times higher in participants with large phases of fat gain and loss compared to subjects with fewer phases. In fact, participants who had more than five cycles of weight gain and loss during their lifetime showed a reduction in muscle mass that was approximately five times greater than those who did not have these cycles.\r\n\r\nThe data from this study highlight the negative consequences on both the quantity and quality of skeletal muscle caused by repetitive weight cycling in participants with obesity, and it is therefore not surprising that there is a higher prevalence of sarcopenia in people who have multiple attempts and failures to lose fat.\r\n\r\nThus, there is a real risk for those subjects with obesity who repeatedly undergo repeated fat loss cycles, leading to loss of muscle mass and strength. These changes in body composition predict functional decline, cardiovascular disease, disability and mortality in subjects with obesity.",
        "excerpt": "It is very common among the population, that arises the spontaneous and urgent need to \"go on a diet\" sporadically to achieve a desperate fat loss for an important event or for the summer, which are nothing more than a desperate and misguided attempt to achieve a timely aesthetic improvement.",
        "tags": "fat loss, muscle tissue",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Diana Polekhina",
        "imageOwnerBacklink": "https://unsplash.com/@diana_pole",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/How_does_fat_loss_cycles_affect_muscle_tissue-diana-polekhina-Q3t49sVquH0-unsplash.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:05:29.164839Z",
        "website": null
      },
      {
        "id": 25,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "Understanding the background of expansion of adipose tissue.",
        "body": "When we increase our body fat, our subcutaneous adipose tissue increases, but when this is not enough to accommodate this excess energy converted into triglycerides, visceral adipose tissue begins to grow (or both at the same time), which, having less adipogenic capacity, grows by hypertrophy, that is, by increasing the size of adipocytes (cells that store fat).\r\n\r\nWhen the expansion of adipose tissue from the differentiation of preadipocytes (adipogenesis) is limited, adipose tissue can only expand through hypertrophy of the adipocyte itself, in order to accommodate excess triglycerides. But its capacity is partially limited, and so a process of adipogenesis is initiated that prevents the adipocyte from expanding further by hypertrophy to critical limits. At that moment hyperplasia of the adipocyte occurs from a preadipocyte (not that the adipocyte divides in two as it is thought hehehe).\r\n\r\nThis process of hyperplasia could be considered as negative, as it allows the adipose tissue to continue increasing, but thanks to hyperplasia it is possible to continue storing energy (fattening) without any metabolic problems. But if the causes that trigger the increase in lipogenesis (such as a positive energy balance) continue, the adipose tissue becomes incompetent at storing triglycerides, making the main mode of expansion happen through adipocyte hypertrophy, which leads to health problems.\r\n\r\nAs adipocyte hypertrophy occurs, they begin to secrete proinflammatory cytokines ultimately leading to lipoinflammation and then chronic inflammation. However, hyperplasia gives us better insulin sensitivity and glucose levels are reduced, decreasing the production of pro-inflammatory cytokines.\r\n\r\nA problem with excessive adipocyte hyperplasia is that when a fat loss process is initiated, let's say that these adipocytes lose their triglyceride content as we lose weight, but are not eliminated in number, making it easier to regain the lost weight later on.",
        "excerpt": "When we increase our body fat, our subcutaneous adipose tissue increases, but when this is not enough to accommodate this excess energy converted into triglycerides, visceral adipose tissue begins to grow (or both at the same time), which, having less adipogenic capacity, grows by hypertrophy, that is, by increasing the size of adipocytes (cells that store fat).",
        "tags": "adipose tissue",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Online Marketing",
        "imageOwnerBacklink": "https://unsplash.com/@impulsq",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/Understanding_the_background_of_expansion_of_adipose_tissue.-online-marketing_y46T3hC.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T07:03:48.360835Z",
        "website": null
      },
      {
        "id": 24,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "10 Causes You Don't Lose Weight",
        "body": "Getting stuck in weight loss is frustrating, but these plateaus are also learning opportunities.\r\n\r\nBelow I summarize 10 common reasons why you don't lose weight and some practical ideas for overcoming them.\r\n\r\n1. You are losing weight but you don't realize it\r\n\r\nYour weight fluctuates from day to day due to a multitude of factors: hydration level, glycogen, stomach contents, fluid retention, menstrual cycle...\r\n\r\nIf you weigh yourself once a week and don't see any variation, you might think that you haven't lost anything. To improve monitoring I recommend weighing yourself daily and calculating the average weight for the week. Comparing the weekly average will smooth out the daily fluctuations and you will be able to see the real progress.\r\n\r\nEvaluating progress by weekly average weight avoids being misled by daily fluctuations. This is especially relevant after the rapid losses of the first few weeks.\r\n\r\nAlso, if you are strength training (and you should be), you will gain muscle mass. This will help you burn more fat, but the total weight loss will be less.If you lose two kilos of fat and gain one kilo of muscle the scale will only reflect a total weight loss of 1 kilo, although this is very good progress. However, someone who does not strength train may lose two kilos of fat and one kilo of muscle. Looking at the scales, he or she would be very happy (3 kilos less!), even though it is a much worse result.\r\n\r\nAlso remember that weight is just one more metric of progress, not necessarily the main one. Another example: if you start supplementing with creatine it is normal to gain 1-2 kg in a short time, but it is not fat, just water. \r\n\r\n2. You eat more than you think\r\n\r\nMost people underestimate the calories they eat, and the difference is especially large in the most overweight people. Many studies note deviations of 20-50%. We are clearly unaware of this error, because we continue to underreport calories even though we know they will be verified later (study) or even though we are paid to improve accuracy (study). We are very easily fooled.\r\n\r\nEven dietitians underestimate their calories by 10%. That's less than half that of the rest of the population, but it's still a big enough error to produce stagnation. What are the most frequent calculation errors?\r\n\r\n- We underestimate portions. What looks like 100 grams of rice to us is actually 150.\r\n- We remember the foods that make us look good (spinach and kale) but tend to forget those we are less proud of (like donuts).\r\n- We count the hundred calories in the salad but not the three hundred in the dressing.\r\n- We log the coffee but not the three tablespoons of coconut oil and butter (which is why I don't recommend bulletproof coffee).\r\n- We don't count liquid calories. Our satiety-signaling mechanisms are little influenced by liquid calories, so it's best to reduce them.\r\n- We don't consider the small snacks we take during the day.\r\n- How to minimize this mistake? Buy a weight like this one and record for a week everything you eat, with apps like myfitnesspal or FatSecret.\r\n\r\n3. You don't base your diet on real food.\r\n\r\nCalories matter, but so does their origin. Real food (minimally processed fresh food) has many benefits over more processed foods:\r\n\r\nIt is more satiating, and thus facilitates calorie control.\r\nIt requires more energy to digest, which reduces the calories that are ultimately absorbed.\r\nIt is more nutritionally dense, and micronutrients also participate in the satiety signal.\r\n\r\nThe result is that by basing food on real food, weight loss is more easily achieved (study).\r\nDiets based on fresh foods facilitate weight loss, those based on ultra-processed foods promote the opposite.\r\n\r\n4. You don't eat enough protein\r\n\r\nProtein-rich diets improve body composition in several ways: \r\n\r\nThey increase satiety. Protein is the most satiating macronutrient.\r\n\r\nThey increase thermogenesis. Some 20-30% of protein calories are expended in their own digestion, making it difficult to ultimately be stored as fat.\r\n\r\nThey minimize muscle loss. Or even facilitate muscle gain if the diet is\r\naccompanied by strength training. What level of protein is ideal for weight loss? Between 1.5 and 2 grams per kg of weight per day.\r\n\r\n5. You relax too much on the weekend\r\n\r\nMany people do well with their diet during the week but relax too much on the weekend. There is no problem in including days with more calories (and we will see that it even has benefits), but if you increase the consumption of alcohol and ultra-processed foods from Friday to Sunday (in addition to reducing physical activity) you will ruin all the progress of the week.\r\n\r\n6. You do not sleep well (or enough)\r\n\r\nSleep deficit damages metabolism by multiple mechanisms . It makes us lose insulin sensitivity, reduces anabolic hormones and increases hunger. We also become more impulsive and find it difficult to control our appetite. If you want to lose weight, pay attention to sleep.\r\n\r\n7. You have been dieting for a long time\r\n\r\nIf you have a lot of fat to lose you must spend months in caloric deficit, and your body interprets that as a threat. Its defense strategy is to slow down metabolism and reduce energy expenditure. In extreme cases it disables entire systems, such as the reproductive system.The result is that losing weight becomes increasingly difficult, and continuing to\r\ndrop calories only makes the problem worse.\r\n\r\nAfter a certain point you should start to include reloads or even whole weeks of rest, where you return to your maintenance calories. This way you reverse the metabolic adaptations that slow down your progress and restart your weight loss, as well as allowing you a psychological respite.\r\n\r\nParadoxically, eating more will help you lose weight.\r\n\r\n8. You move not enough\r\n\r\nLosing weight through diet alone is possible, but not recommended. For starters, you will lose more muscle mass, damaging your aesthetics and your health. In addition, after a certain point, cutting more calories will become too hard, and will only increase your appetite and frustration. Adding physical activity is the solution.\r\n\r\nWhen thinking about energy expenditure we tend to focus on the workout, ignoring the rest of the movement. However, all that low-intensity movement we do throughout the day, called NEAT or Non-Exercise Activity Thermogenesis, is often what determines whether you lose fat or plateau. \r\n\r\nBetween two people of similar size there can be variations of up to 2,000 calories per day far more than what is possible to achieve in the hour we spend training.\r\n\r\nBy moving more you will be able to eat more while still losing weight, the dietary holy grail. Technically we call this effect \"high energy flow\", which makes the process much more bearable.\r\n\r\n9. Your microbiota is altered\r\nOur bacteria influence countless metabolic processes, many of them associated with weight regulation. For example, butyrate produced by your bacteria in the colon reduces appetite and improves metabolism (detail, detail).A poor microbiota promotes overweight. \r\n\r\nThe type of bacteria you have (and their balance) influences your appetite for some foods or others, the amount of calories you absorb from food, the production of butyrate, your level of inflammation... and all these factors determine how easy it is for you to lose weight.\r\n\r\nIncluding the right food for your bacteria will help you lose weight.\r\n\r\n10. Taking medications\r\n\r\nAll medications have side effects, including, in some cases, weight gain. It is more difficult to lose weight with many types of antidepressants, glucocorticoids and beta-blockers.\r\n\r\nProlonged consumption of antibiotics is also associated with more overweight, due to its negative effect on the microbiota. Obviously you should take the medications you need, but be aware of their possible effects.",
        "excerpt": "Getting stuck in weight loss is frustrating, but these plateaus are also learning opportunities. Below I summarize 10 common reasons why you don't lose weight and some practical ideas for overcoming them.",
        "tags": "lose weight, weight loss, weight",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": "Towfiqu barbhuiya",
        "imageOwnerBacklink": "https://unsplash.com/@towfiqu999999",
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/10_Causes_You_Dont_Lose_Weight-towfiqu-barbhuiya-J6g_szOtMF4-unsplash.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T06:58:29.981259Z",
        "website": null
      },
      {
        "id": 23,
        "category": {
          "id": 10,
          "title": "Weight Loss",
          "categoryDesc": "Evergreen weight loss blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Weight_Loss-weight-loss.png"
        },
        "title": "7 Habits to Lose Weight with any Diet",
        "body": "When it comes to weight loss, the concern of most people is trying to select the most effective diet. No doubt some diets are more recommendable than others, but in the long term the results depend more on habits than on specific diets.\r\n\r\nIf you see change as something temporary, you will surely fail. When you go back to your usual habits, the usual kilos will come back, plus some extra.\r\n\r\nYou must of course choose a good eating plan, but then focus on the new habits to develop. In this article you will learn about the habits that are usually associated with long-term success, and concrete ideas for incorporating them. \r\n\r\n1. Allow some flexibility (Flexible Control).\r\n\r\nVery restrictive diets are difficult to maintain over time. Eliminating foods you enjoy forever\r\nreduces adherence by requiring too much willpower. In addition, we want more of what we\r\ncan't have, and this rigid control raises the risk of cravings (study) and possibly binge eating.\r\nOn the other hand, excessive flexibility is also negative. To achieve certain goals you must\r\nmake certain sacrifices, and that means setting limits for yourself.\r\n\r\nThat ideal balance point is what some studies call \"flexible control,\" which will vary from\r\nperson to person.\r\n\r\nMaintaining flexible control involves paying attention to food and following certain guidelines, but understanding that your progress doesn't stop because you have your favorite pizza for dinner one day. It's about prioritizing real food and being mindful of portions, without self-punishing or blaming yourself if one day you overeat or eat something undesirable.\r\n\r\nWhile this flexible control facilitates the maintenance of lost weight, rigid control is\r\nassociated with worse long-term results. In addition, rigid control can lead to a dangerous obsession with achieving a supposed dietary purity. When you fail in this impossible mission, you break down, worsening your results. \r\n\r\nAvoid the all-or-nothing mentality. Seek progress, not perfection.\r\n\r\n2. Reduce snacks\r\n\r\nThe belief that we should eat five or six meals a day is a recent one. In the 1970s most people ate three large meals a day, but this number increased over time.On the one hand, nutritional recommendations leaned toward smaller meals, thinking that this would better control hunger and keep metabolism high (both ideas are wrong). On the other hand, the food industry increased its promotion of mid-morning and mid-afternoon snacks.\r\n\r\nThey knew that if we increase the number of daily intakes we will tend to eat more, and big\r\nstomachs are more profitable than small ones. Thus, the average number of meals increased from the typical three meals a day just a few decades ago to the current five or six. Calories from snacks have increased in all age ranges, contributing to the current caloric excess Snacks are adding more and more calories. \r\n\r\n3. Cook more and eat out less\r\n\r\nCooking is one of the best skills you can develop. It's not about elaborating sophisticated\r\ndishes, but about defending yourself with the basics. In the time Master Chef lasts, you can\r\nprepare food for several days. You will also avoid exposing yourself to their misleading\r\npropaganda.\r\n\r\nCooking more at home and eating less in restaurants are habits that are associated with less weight gain .\r\n\r\nWhen cooking you have much more control over your meals, both their size and their\r\ningredients. You will certainly use better oils and lower calorie sauces.\r\n\r\nIf you eat out often, try to follow some rules:\r\n1. Tell them not to put bread or snacks on the table.\r\n2. If you order salad, have them serve the sauce on the side, or simply add oil and\r\nvinegar.\r\n3. Ask them to swap undesirable side dishes (such as chips) for some salad.\r\n4. You don't have to eat everything on your plate. Eating more than you need is also\r\nwasting food, and you will carry the excess with you in the form of fat. Besides, in most\r\nrestaurants you can take the leftovers with you.\r\n5. Skip dessert, or just order a piece of fruit.\r\n\r\n4. Reconnect with your body's signals\r\n\r\nIf you have followed a strict diet, for example a ketogenic or PSMF approach, you have\r\nprobably had to count calories and macronutrients. This has benefits and I recommend doing it for a while, but if you do it consistently you raise the risk of disconnecting from your body.\r\n\r\nOnce you are at your ideal weight, you must learn to reconnect with your body's internal\r\nsignals, stopping eating when you are satisfied, without becoming full. This is precisely what is recommended by the millenary Japanese technique of Hara hachi bu, or 80% belly.\r\nThe goal is for your body, not your phone, to tell you when to stop eating. \r\n\r\nTo achieve this, you must be more conscious when eating, and this is precisely the following recommendation.\r\n\r\n5. Be more conscious when eating\r\n\r\nWe make more than 200 food decisions a day, most of them unconscious (detail). If you don't think about what you eat and don't control your portions, you will be at the mercy of your impulses and easily manipulated by commercial interests. \r\n\r\nIn fact, this process of awareness should begin long before you sit down at the table. When\r\nyou go shopping, take a list with you. Don't buy anything that is not on the list if you don't\r\nneed it, even if it is on sale. Refuse free samples.\r\n\r\nAt mealtime, chew calmly and pay attention ,avoiding eating in front of the TV or in the\r\npresence of any other distraction (like checking Instagram). Eat the allotted portion and do not repeat, unless you are really hungry.\r\n\r\nDon't eat directly from the fridge or packaging. Take out the portion, serve it on a plate and\r\nsave the rest.\r\n\r\nIn short, it's about becoming more aware of the choices you make around food, and that\r\nincreased awareness will improve your behavior (meta-analysis).Remind yourself often why you do this. Aligning your behavior with your values improves your ability to self-regulate, tolerate uncomfortable feelings, and become more aware of your decisions.\r\n\r\n6. Weigh yourself frequently\r\n\r\nI know this recommendation is not very popular, but the evidence is clear. People who weigh\r\nthemselves frequently lose more weight and regain less weight. People who weigh themselves more frequently lose more weight. \r\n\r\nSome believe that weighing can generate anxiety, but the evidence does not seem to support this idea. And if this were to happen, it would not be the fault of the scale, but of our\r\nrelationship with weight. \r\n\r\nTo begin with, you must understand that weight fluctuations are normal, and that your progress is measured by many other variables (measurements, muscle, performance, energy level...). Furthermore, if you gain two kilos of muscle and lose two kilos of fat, your body will look much better, even though your weight has not undergone any variation. \r\n\r\nBut all this does not imply that you should ignore weight, but understand it and put it in\r\ncontext. And above all, you should avoid linking your personal worth to the value indicated by the scale. If you allow your weight to define you, stopping weighing yourself does not solve the problem.\r\n\r\nAnother benefit of weighing yourself frequently is that you see the trend more clearly,\r\navoiding that punctual fluctuations make you make wrong decisions. Don't obsess about your weight, but don't ignore it either.\r\n\r\n7. Include physical activity\r\n\r\nIncreasing physical activity, especially strength training, will not only enhance the results of the diet, but is one of the habits most strongly associated with long-term weight maintenance.\r\nExercise benefits us by multiple mechanisms:\r\n1. It helps regulate appetite.\r\n2. It improves insulin sensitivity.\r\n3. It raises metabolism, especially strength training.\r\n4. Increases energy expenditure.\r\n5. It improves our mood.\r\n\r\nSummary and conclusions\r\n\"All happy families resemble each other, but every unhappy family is unhappy in its own way\" - Leo Tolstoy (Anna Karenina).\r\n\r\nThe so-called Anna Karenina principle indicates that success requires the presence of many\r\nspecific factors, while failure can be explained by the lack of any one of them. Success is\r\ntherefore a much more fragile state, since in the absence of certain conditions it will result in chaos.",
        "excerpt": "When it comes to weight loss, the concern of most people is trying to select the most effective diet. No doubt some diets are more recommendable than others, but in the long term the results depend more on habits than on specific diets.",
        "tags": "weight loss,diet,habits",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": null,
        "imageOwnerName": null,
        "imageOwnerBacklink": null,
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/7_Habits_to_Lose_Weight_with_any_Diet-i-yunmai-5jctAMjz21A-unsplash.jpg",
        "videoURL": null,
        "date_published": "2022-09-10T06:51:59.740377Z",
        "website": null
      },
      {
        "id": 22,
        "category": {
          "id": 2,
          "title": "Fitness",
          "categoryDesc": "Evergreen fitness blogs.",
          "categoryImage": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/1/Fitness-Fitness.png"
        },
        "title": "3 Fat-Loss Myths – Debunked",
        "body": "Have you ever tried losing weight, thought you were doing everything correctly, and still didn’t see the progress you wanted? Sure, there are a number of reasons why you weren’t seeing the results, but what if the changes you made to your diet weren’t actually that helpful–or even downright useless?\r\n\r\nThere are numerous myths surrounding the “best” eating plans and nutrition protocols for successful (and rapid) weight loss. Unfortunately, these myths often become prominent hallmarks within the programs of unknowing individuals who pursue their fitness goals with misguided information. They find themselves bound to unhelpful, sometimes dangerous eating rules for years on end before they discover it’s been for naught.\r\n\r\nIn this article I’ll cover three popular fat-loss myths, all relevant to concerns regarding metabolism–the chemical process within your body responsible for producing and burning energy (calories).\r\n\r\nMyth #1: Metabolism Can’t Be Altered\r\n\r\nWith the release of a New York Times article discussing the unfortunate outcome of many “Biggest Loser” contestants, many people come to believe that their metabolism is out of their control. Fortunately, this isn’t completely true. While prolonged weight loss can cause “metabolic adaptation” (the slowing of your metabolism to adjust to the new level of nutrient intake), a regular strength-training routine can help combat this adaptation by increasing one’s resting metabolic rate—the number of calories one burns at rest. This occurs because muscle is “metabolically active,” meaning muscle tissue requires extra energy to maintain itself. This extra energy needed for maintenance and growth of muscle tissue can slow the rate of this metabolic slowdown, and help increase metabolic rate once a goal weight is reached.\r\n\r\nAdditionally, more modest calorie restrictions can help prevent unnecessary metabolic adaptation. A good rule of thumb is to eat the most amount of calories that still allows you to lose weight. This not only slows down the rate of metabolic adaptation, but will also leave you with additional wiggle room to further reduce calories when your program calls for it.\r\nMyth #2: Small, Frequent Meals Help Stoke The “Metabolic Fire.” \r\n\r\nThere was an old belief that small frequent meals would speed up metabolism, because just like a fire, constantly supplying the body with nutrients would keep the “metabolic fire” aflame. However, research conducted on this subject found that eating only two meals a day, compared to three meals a day, had no effect on total energy expenditure throughout the day.\r\n\r\nDoes this mean frequent meals are a waste of time? Not necessarily, as more frequent meals may be able to help individuals better control total calorie consumption (by avoiding binge-like eating behaviors). However, some individuals find it easier to eat fewer meals throughout the day, both as a way to help control appetite and because it simply fits better with their lifestyle. The best approach is to find an eating frequency that works for you–allowing you to successfully eat the proper amount of nutrients while maintaining a modest calorie deficit.\r\n\r\nMyth #3: Calories Eaten Late At Night Will Turn to Fat\r\n\r\nNumerous studies have shown a correlation between late night eating and weight gain. However, this weight gain was likely caused as a result of total caloric over-consumption, and not because of its effect on their metabolism. In other words, late-night snack eaters consume more calories because they are ingesting additional food when their non-snacking counterparts are sleeping or engaging in other, non-food related activities. The research is clear: as long as you remain in a calorie deficit, consuming a meal close to bedtime does not increase fat accumulation more than a meal consumed during normal daytime hours.\r\n\r\nIf eating close to bedtime (such as in an intermittent fasting diet) works best for your lifestyle, go right ahead. Some individuals might even find it easier to fall asleep when they aren’t trying to ignore hunger pangs because they haven’t eaten since 4pm.\r\n\r\nThe realities behind these myths provide some promising insights:\r\n\r\n• Metabolism is a dynamic process. Yes, it adapts and slows down the longer you remain on a weight-loss diet, but you can also combat and reverse this effect through strength training and gradual calorie changes.\r\n• Meal frequency has a much smaller affect on fat accumulation than previously believed. (Almost negligible.) This means you have much more freedom to time your meals in a manner that fits best with your lifestyle–making your nutrition plan easier to maintain.\r\n• As long as you remain in a modest calorie deficit, eating just before bed is OK. So if you’re like me and enjoy a bedtime snack before getting some shuteye, go on with your Halo-Top eating self.",
        "excerpt": "Have you ever tried losing weight, thought you were doing everything correctly, and still didn’t see the progress you wanted? Sure, there are a number of reasons why you weren’t seeing the results, but what if the changes you made to your diet weren’t actually that helpful–or even downright useless?",
        "tags": "weight loss, myths,metabolism",
        "contentSourceName": null,
        "contentSourceURL": null,
        "extraImageUrl": null,
        "extraImageAttribution": "Photo by Total Shape",
        "imageOwnerName": null,
        "imageOwnerBacklink": null,
        "image": "https://s3.us-west-004.backblazeb2.com/encurate/static/blogsapi/2/3_Fat-Loss_Myths__Debunked-3_Fat-Loss_Myths__Debunked.jpg",
        "videoURL": null,
        "date_published": "2022-09-03T02:27:00.634770Z",
        "website": null
      }
    ]
  }